
# 문제 81
scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
*a, b, c = scores
valid_score = a
print(valid_score)

# 문제 82
scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
d, e, *f = scores
valid_score = f
print(valid_score)

# 문제 83
scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
g, *h, i = scores
valid_score = h
print(valid_score)

# 문제 84
temp = {}

# 문제 85
dict = {'메로나': 1000, '폴라포': 1200, '빵빠레': 1800}
print(dict)

# 문제 86
dict.update({'죠스바': 1200, '월드콘': 1500})
print(dict)

# 문제 87
ice = {'메로나': 1000,
       '폴라포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}
print("메로나 가격:", ice.get('메로나'))

# 문제 88
ice = {'메로나': 1000,
       '폴라포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}
ice['메로나'] = 1300
print(ice)


# 문제 89
ice = {'메로나': 1000,
       '폴라포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}
del ice['메로나']
print(ice)

# 문제 90
icecream = {'폴라포': 1200,
            '빵빠레': 1800,
            '죠스바': 1200,
            '월드콘': 1500}

# icecream['누가바']
"""
'누가바'는 icecream 딕셔너리 안에 없는 키값이여서
"""
