
# 문제 141
리스트 = [100, 200, 300]
for 변수 in 리스트:
    print(변수+10)

# 문제 142
리스트 = ["갑밥", "라면", "튀김"]
for 변수 in 리스트:
    print("오늘의 메뉴:",변수)

# 문제 143
리스트 = ["SK하이닉스", "삼성전자", "LG전자"]
for 변수 in 리스트:
    print(len(변수))

# 문제 144
리스트 = ["dog", "cat", "parrot"]
for 변수 in 리스트:
    print(변수, len(변수))

# 문제 145
리스트 = ["dog", "cat", "parrot"]
for 변수 in 리스트:
    print(변수[0])

# 문제 146
리스트 = [1, 2, 3]
for 변수 in 리스트:
    print(f"3 x {변수}")

# 문제 147
리스트 = [1, 2, 3]
for 변수 in 리스트:
    print(f"3 x {변수} = {3*변수}")

# 문제 148
리스트 = ["가", "나", "다", "라"]
for 변수 in 리스트[1:]:
    print(변수)

# 문제 149
리스트 = ["가", "나", "다", "라"]
for 변수 in 리스트[::2]:
    print(변수)

# 문제 150
리스트 = ["가", "나", "다", "라"]
for 변수 in 리스트[::-1]:
    print(변수)
